app/controllers/events_controller.rb

  def show
    @events = Event.find(params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]