app/controllers/users_controller.rb

  def show
    @users = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]

  def edit
    @users = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]

def update
  users_params = params.require(:user).permit(:first_name,:last_name)
  @user = User.find(params[:id])
  if @user.update(users_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "users" SET "first_name" = $1, "last_name" = $2 WHERE "users"."id" = $3  [["first_name", "Jonathan"], ["last_name", "Schafeitel"], ["id", 11]]